# PANDAS 
Pandas is an open source ,BSD-licensed library providing high-performance,easy-to-use data  structures and data analysis tools for the python programming language.

### DATAFRAMES,SERIES,OPERATION IN PANDAS

#### DATAFRAMES- 2D (rows and columns) labeled data structure with column of potentially different types

##### get some more information  click shift+tab

In [3]:
import pandas as pd  # importing the dependencies
import numpy as np

In [4]:
# playing with dataframe [DATAFRAME- ROWS AND COLUMNS looks like dataset]
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['row1','row2','row3','row4','row5'],columns=['column1','column2','column3','column4'])

In [7]:
df.head()

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [9]:
df.to_csv('Test1.csv')

In [67]:
df.to_csv('Test.csv')

In [10]:
## accessing the elements
## Loc and iloc are two functions in Pandas that are used to slice a data set in a Pandas DataFrame.
## The function . loc is typically used for label indexing and can access multiple columns, while . iloc is used for integer indexing.
df.loc['row1']

column1    0
column2    1
column3    2
column4    3
Name: row1, dtype: int32

In [14]:
##check the type 
type(df.loc['row1'])  ## loc is a series

pandas.core.series.Series

In [15]:
df.loc['row2']

column1    4
column2    5
column3    6
column4    7
Name: row2, dtype: int32

In [16]:
df.iloc[:,:]

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [18]:
df.iloc[:,1:] ## this functions removes the column1

      column2  column3  column4
row1        1        2        3
row2        5        6        7
row3        9       10       11
row4       13       14       15
row5       17       18       19

In [19]:
df.iloc[0:3,0:2]

      column1  column2
row1        0        1
row2        4        5
row3        8        9

In [20]:
df.iloc[1:4,0:]

      column1  column2  column3  column4
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15

In [21]:
df.iloc[3:,0:2]

      column1  column2
row4       12       13
row5       16       17

In [23]:
df.iloc[0:2,0:2]

      column1  column2
row1        0        1
row2        4        5

In R programming language the Index value starts from 1
In Python programming language the Index value starts from 0

In [25]:
type(df.iloc[0:2,0:2])   ## It is a pandas dataframe

pandas.core.frame.DataFrame

In [26]:
type(df.iloc[0:2,0:1])   ## It is a pandas dataframe

pandas.core.frame.DataFrame

In [27]:
df.iloc[0:2,0:1]

      column1
row1        0
row2        4

## SERIES -It is a one dimensional array holding data of any type

In [28]:
df.iloc[0:2,0]

row1    0
row2    4
Name: column1, dtype: int32

In [30]:
type(df.iloc[0:2,0])  ## it is pandas series

pandas.core.series.Series

In [33]:
df.iloc[0:2]

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7

##### CONVERT DATAFRAMES INTO ARRAY

In [34]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [36]:
df.iloc[:,1:].values.shape ## (rows and columns)

(5, 3)

CHECKING FOR NULL VALUES AND ITS SUM

In [37]:
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [38]:
df

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [39]:
df['column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: column1, dtype: int64

In [41]:
df['column1'].unique()

array([ 0,  4,  8, 12, 16])

In [42]:
df['column3']

row1     2
row2     6
row3    10
row4    14
row5    18
Name: column3, dtype: int32

In [44]:
type(df['column3']) #PANDAS SERIES

pandas.core.series.Series

RETERIVING MORE THAN ONE COLUMN

In [46]:
df[['column1','column2']]  ## reteriving more than one column using the list

      column1  column2
row1        0        1
row2        4        5
row3        8        9
row4       12       13
row5       16       17

# PANDAS,READING CSV FILES WITH VARIOUS PARAMETERS

In [54]:
df=pd.read_csv('C:/Users/deepi/Downloads/diabetes.csv') ## copy the path from the file stored in the location (local folder)

In [56]:
df.head()  ## Displaying the top 5 records(rows)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 9 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Pregnancies               768 non-null    int64
 1   Glucose                   768 non-null    int64
 2   BloodPressure             768 non-null    int64
 3   SkinThickness             768 non-null    int64
 4   Insulin                   768 non-null    int64
 5   BMI                       768 non-null    float64
 6   DiabetesPedigreeFunction  768 non-null    float64
 7   Age                       768 non-null    int64
 8   Outcome                   768 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 54.1 KB

In [58]:
df.describe() ## 25 percentile,50,percentile,75 percentile

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
count,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000
mean,3.845052,120.894531,69.105469,20.536458,79.799479,31.992578,0.471876,33.240885,0.348958
std,3.369578,31.972618,19.355807,15.952218,115.244002,7.884160,0.331329,11.760232,0.476951
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000
25%,1.000000,99.000000,62.000000,0.000000,0.000000,27.300000,0.243750,24.000000,0.000000
50%,3.000000,117.000000,72.000000,23.000000,30.500000,32.000000,0.372500,29.000000,0.000000
75%,6.000000,140.250000,80.000000,32.000000,127.250000,36.600000,0.626250,41.000000,1.000000
max,17.000000,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000

In [59]:
df.shape

(768, 9)

In [61]:
df.size

6912

In [64]:
test1_df=pd.read_csv('test1.csv',sep=';') ## the csv file test1.csv the values present in this files are separated with the semicolon(;) so we put sep=;

In [66]:
test1_df.head()

  Unnamed: 0  column1  column2  column3  column4
0       row1        0        1        2        3
1       row2        4        5        6        7
2       row3        8        9       10       11
3       row4       12       13       14       15
4       row5       16       17       18       19

In [68]:
test1_df=pd.read_csv('test1.csv')

In [69]:
test1_df.head()

  ;column1;column2;column3;column4
0                     row1;0;1;2;3
1                     row2;4;5;6;7
2                   row3;8;9;10;11
3                 row4;12;13;14;15
4                 row5;16;17;18;19

In [73]:
df[df['Insulin']>100].head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
4,0,137,40,35,168,43.1,2.288,33,1
8,2,197,70,45,543,30.5,0.158,53,1
13,1,189,60,23,846,30.1,0.398,59,1
14,5,166,72,19,175,25.8,0.587,51,1
16,0,118,84,47,230,45.8,0.551,31,1

# csv

In [74]:
from io import StringIO,BytesIO

In [84]:
data=('col1,col2,col3\n''x,y,1\n''a,b,2\n''c,d,3')

In [79]:
type(data)

str

In [85]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [88]:
df=pd.read_csv(StringIO(data),usecols=['col1','col2'])

In [89]:
df

  col1 col2
0    x    y
1    a    b
2    c    d

In [86]:
# READ FROM THE SPECIFIC COLUMN 
df=pd.read_csv(StringIO(data),usecols=lambda x: x.upper() in ['COL1','COL3'])

In [87]:
df.to_csv('test.csv')

In [96]:
## specifying the columns with datatype
data=('a,b,c,d\n''1,2,3,4\n''5,6,7,8\n''9,10,11,12')

In [92]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11

In [97]:
df=pd.read_csv(StringIO(data),dtype=object)

In [98]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [95]:
df['a'][1]## a-column name,1-row name

'5'

In [101]:
df=pd.read_csv(StringIO(data),dtype={'b':int,'c':float,'a':'Int64'})

In [102]:
df

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [104]:
## check for datatype
df.dtypes

a      Int64
b      int32
c    float64
d      int64
dtype: object

In [105]:
## Index columns and training delimiters
data=('index,a,b,c\n''4,apple,bat,5.7\n''8,orange,cow,10')

In [107]:
pd.read_csv(StringIO(data))

   index       a    b     c
0      4   apple  bat   5.7
1      8  orange  cow  10.0

In [106]:
pd.read_csv(StringIO(data),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [110]:
data=('a,b,c\n''4,apple,bat\n''8,orange,cow')

In [111]:
pd.read_csv(StringIO(data),index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [112]:
## combining usecols and index_col
data=('a,b,c\n''4,apple,bat\n''8,orange,cow')

In [113]:
pd.read_csv(StringIO(data),usecols=['b','c'],index_col=False)

        b    c
0   apple  bat
1  orange  cow

In [ ]:
## Quoting and escape characters very useful in NLP-NATURAL LANGUAGE PROCESSING 
data='a,b\n'"hello,\\"bob\\",nice to see you",5'

In [ ]:
pd.read_csv(StringIO(data),escapechar='\\')

In [ ]:
## url to csv
df=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu/item',sep='\t')

In [116]:
## tu=7    ti=3.03(convert JSON TO CSV)

In [115]:
## tu=7    ti=13.04(read HTML)